# BendingDetailVaryingRebarDimension Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailVaryingRebarDimension Property
ParameterTypeId Class See Also
---
"Varying Rebar Set Dimensions"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailVaryingRebarDimension { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailVaryingRebarDimension As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailVaryingRebarDimension {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace